Sysbench_PolarDB_Mysql5.7-8.0/Sysbench_Mysql8.0_log/Mysql8.0-8Core32GB-1Node/ｽｵﾅ莠ｹｲ・500/202103111653/sysbench_read_write_5000.log
Time: 20210311165713, now running sysbench with thread of:  + 5000
Running command: sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --mysql-host=pc-0iwuxs5pjj32y2qqh.rwlb.japan.rds.aliyuncs.com --mysql-port=3306 --mysql-user=sbtest --mysql-password=Test1234 --mysql-db=sbtest --table-size=100000000 --tables=500 --events=0 --time=60 --db-ps-mode=disable --percentile=95 --report-interval=1 --threads=5000 run
sysbench 1.0.18-ab7d582 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 5000
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 5000 tps: 0.89 qps: 45904.76 (r/w/o: 41386.48/77.26/4441.02) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 5000 tps: 0.00 qps: 10466.06 (r/w/o: 10464.06/2.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 5000 tps: 167.00 qps: 15303.33 (r/w/o: 9616.20/5355.11/332.01) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 5000 tps: 1294.06 qps: 33702.67 (r/w/o: 22083.10/9029.45/2590.13) lat (ms,95%): 4055.23 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 5000 tps: 1459.90 qps: 27491.13 (r/w/o: 16845.86/7840.47/2804.81) lat (ms,95%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 5000 tps: 3073.14 qps: 31799.41 (r/w/o: 16952.75/10513.47/4333.19) lat (ms,95%): 6026.41 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 5000 tps: 478.01 qps: 30823.47 (r/w/o: 21038.32/8083.12/1702.03) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 5000 tps: 3020.87 qps: 34367.51 (r/w/o: 25071.91/4284.81/5010.78) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 5000 tps: 2517.05 qps: 38097.76 (r/w/o: 24753.49/8266.16/5078.10) lat (ms,95%): 3040.14 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 5000 tps: 277.01 qps: 24866.17 (r/w/o: 21092.99/2839.13/934.04) lat (ms,95%): 3639.94 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 5000 tps: 1807.86 qps: 23925.09 (r/w/o: 14631.83/6133.51/3159.75) lat (ms,95%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 5000 tps: 0.00 qps: 8409.86 (r/w/o: 7526.88/272.00/610.99) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 5000 tps: 1927.98 qps: 38092.64 (r/w/o: 26333.75/7683.93/4074.96) lat (ms,95%): 5217.92 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 5000 tps: 1839.00 qps: 45158.03 (r/w/o: 33149.02/8273.00/3736.00) lat (ms,95%): 5507.54 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 5000 tps: 1810.20 qps: 38001.15 (r/w/o: 25875.83/8574.94/3550.39) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 5000 tps: 1895.06 qps: 36382.18 (r/w/o: 22740.74/10326.33/3315.11) lat (ms,95%): 7895.16 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 5000 tps: 1935.63 qps: 28069.71 (r/w/o: 20311.17/2829.47/4929.07) lat (ms,95%): 8955.74 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 5000 tps: 1457.09 qps: 17071.04 (r/w/o: 12882.78/666.04/3522.21) lat (ms,95%): 9452.83 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 5000 tps: 673.98 qps: 24615.14 (r/w/o: 21000.27/2112.93/1501.95) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 5000 tps: 1072.00 qps: 30844.96 (r/w/o: 23187.97/5457.99/2199.00) lat (ms,95%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 5000 tps: 45.00 qps: 35153.96 (r/w/o: 21543.81/13492.14/118.01) lat (ms,95%): 5709.50 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 5000 tps: 1734.97 qps: 34176.35 (r/w/o: 22840.56/7866.85/3468.93) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 5000 tps: 1958.88 qps: 36970.66 (r/w/o: 24467.45/8666.45/3836.76) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 5000 tps: 2285.35 qps: 39952.08 (r/w/o: 27377.16/8547.30/4027.61) lat (ms,95%): 8184.67 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 5000 tps: 4206.85 qps: 42475.47 (r/w/o: 27655.00/7057.75/7762.72) lat (ms,95%): 2880.27 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 5000 tps: 1217.93 qps: 31881.26 (r/w/o: 28563.44/136.99/3180.83) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 5000 tps: 64.00 qps: 708.97 (r/w/o: 572.98/5.00/130.99) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 5000 tps: 15.00 qps: 9541.52 (r/w/o: 8649.47/351.02/541.03) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 5000 tps: 0.00 qps: 17970.41 (r/w/o: 12302.60/5654.81/13.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 5000 tps: 1309.06 qps: 27328.20 (r/w/o: 12939.57/12693.56/1695.07) lat (ms,95%): 5607.61 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 5000 tps: 3721.10 qps: 42998.21 (r/w/o: 29073.82/8053.23/5871.17) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 5000 tps: 2452.74 qps: 38625.97 (r/w/o: 26965.18/6893.28/4767.50) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 5000 tps: 8.00 qps: 36723.27 (r/w/o: 26714.65/8235.51/1773.11) lat (ms,95%): 2728.81 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 5000 tps: 1973.10 qps: 39581.06 (r/w/o: 27294.42/8749.46/3537.18) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 5000 tps: 3618.92 qps: 39611.08 (r/w/o: 27928.35/5815.86/5866.86) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 5000 tps: 1220.52 qps: 36746.87 (r/w/o: 25139.71/8830.86/2776.31) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 5000 tps: 2037.86 qps: 41560.35 (r/w/o: 28805.60/8656.58/4098.18) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 5000 tps: 4082.03 qps: 46840.31 (r/w/o: 31541.21/6363.04/8936.06) lat (ms,95%): 3639.94 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 5000 tps: 443.99 qps: 51022.11 (r/w/o: 45851.20/2760.95/2409.96) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 5000 tps: 1479.91 qps: 36574.66 (r/w/o: 25454.37/8159.48/2960.81) lat (ms,95%): 3448.53 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 5000 tps: 1635.00 qps: 42374.97 (r/w/o: 27142.98/11961.99/3270.00) lat (ms,95%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 5000 tps: 3993.03 qps: 52905.40 (r/w/o: 36191.27/8728.07/7986.06) lat (ms,95%): 4855.31 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 5000 tps: 1540.15 qps: 40300.83 (r/w/o: 30854.93/6365.61/3080.29) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 5000 tps: 1560.08 qps: 33190.68 (r/w/o: 22457.14/7613.39/3120.16) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 5000 tps: 1934.86 qps: 33798.48 (r/w/o: 23192.27/6737.50/3868.71) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 5000 tps: 1417.03 qps: 41320.78 (r/w/o: 29447.56/9038.17/2835.05) lat (ms,95%): 4358.09 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 5000 tps: 2663.92 qps: 38123.87 (r/w/o: 24211.28/8610.75/5301.84) lat (ms,95%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 5000 tps: 1966.77 qps: 43380.93 (r/w/o: 32408.21/7013.18/3959.54) lat (ms,95%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 5000 tps: 1197.17 qps: 32268.46 (r/w/o: 23629.27/6244.86/2394.33) lat (ms,95%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 5000 tps: 1217.02 qps: 27824.55 (r/w/o: 19482.39/5908.12/2434.05) lat (ms,95%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 5000 tps: 1993.96 qps: 37632.16 (r/w/o: 24682.45/8961.80/3987.91) lat (ms,95%): 4855.31 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 5000 tps: 2037.83 qps: 37629.78 (r/w/o: 26710.71/6843.41/4075.65) lat (ms,95%): 5312.73 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 5000 tps: 3405.35 qps: 43602.43 (r/w/o: 27033.75/9758.99/6809.69) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 5000 tps: 1653.87 qps: 44573.43 (r/w/o: 34033.27/7231.42/3308.73) lat (ms,95%): 3706.08 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 5000 tps: 723.03 qps: 24024.01 (r/w/o: 18881.79/3696.16/1446.06) lat (ms,95%): 3706.08 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 5000 tps: 1360.98 qps: 31679.62 (r/w/o: 22033.74/6924.92/2720.97) lat (ms,95%): 3639.94 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 5000 tps: 1040.94 qps: 26604.52 (r/w/o: 19465.92/5055.72/2082.88) lat (ms,95%): 4128.91 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 5000 tps: 1131.11 qps: 19863.95 (r/w/o: 12221.20/5382.53/2260.22) lat (ms,95%): 5033.35 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 5000 tps: 1277.97 qps: 26167.41 (r/w/o: 17643.60/6002.87/2520.94) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 5000 tps: 1550.00 qps: 25142.06 (r/w/o: 17451.04/4554.01/3137.01) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 5000 tps: 1139.04 qps: 24170.95 (r/w/o: 17138.67/4757.19/2275.09) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 5000 tps: 1193.85 qps: 27431.49 (r/w/o: 20031.44/5009.36/2390.69) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 5000 tps: 1275.08 qps: 24208.47 (r/w/o: 16749.01/4909.30/2550.15) lat (ms,95%): 7895.16 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 5000 tps: 1509.07 qps: 30159.33 (r/w/o: 20923.93/6218.28/3017.13) lat (ms,95%): 6135.91 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 5000 tps: 1327.95 qps: 28050.88 (r/w/o: 19887.20/5507.78/2655.89) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 5000 tps: 1633.88 qps: 29466.90 (r/w/o: 20254.56/5943.58/3268.77) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 5000 tps: 1715.16 qps: 32428.01 (r/w/o: 22564.10/6435.60/3428.32) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 5000 tps: 1831.12 qps: 34767.33 (r/w/o: 24553.64/6549.44/3664.25) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 5000 tps: 1943.82 qps: 38537.50 (r/w/o: 26981.55/7669.30/3886.65) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 5000 tps: 2391.99 qps: 44791.90 (r/w/o: 31761.93/8246.98/4782.99) lat (ms,95%): 4358.09 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 5000 tps: 1563.02 qps: 36784.42 (r/w/o: 27519.31/6137.07/3128.04) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 5000 tps: 1237.92 qps: 26187.30 (r/w/o: 17522.86/6189.60/2474.84) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 5000 tps: 949.04 qps: 26737.19 (r/w/o: 19960.89/4877.22/1899.08) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 5000 tps: 1107.00 qps: 19337.03 (r/w/o: 12266.02/4857.01/2214.00) lat (ms,95%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 5000 tps: 1335.06 qps: 23051.12 (r/w/o: 15387.75/4997.24/2666.13) lat (ms,95%): 5507.54 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 5000 tps: 1456.06 qps: 28115.21 (r/w/o: 19631.85/5573.24/2910.13) lat (ms,95%): 5918.87 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 5000 tps: 1465.87 qps: 36941.62 (r/w/o: 27132.52/6872.37/2936.73) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 5000 tps: 1502.11 qps: 27848.01 (r/w/o: 19073.38/5769.42/3005.22) lat (ms,95%): 5312.73 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 5000 tps: 1547.96 qps: 28767.22 (r/w/o: 19598.47/6072.84/3095.92) lat (ms,95%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 5000 tps: 1308.96 qps: 25032.16 (r/w/o: 17508.41/4905.84/2617.91) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 5000 tps: 1414.60 qps: 26819.13 (r/w/o: 18391.84/5600.05/2827.23) lat (ms,95%): 5507.54 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 5000 tps: 1444.68 qps: 31976.02 (r/w/o: 23348.39/5737.26/2890.37) lat (ms,95%): 4943.53 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 5000 tps: 1847.07 qps: 32927.29 (r/w/o: 22337.88/6894.27/3695.14) lat (ms,95%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 5000 tps: 1474.02 qps: 33068.36 (r/w/o: 24246.26/5874.06/2948.03) lat (ms,95%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 5000 tps: 1571.99 qps: 33233.85 (r/w/o: 23162.90/6926.97/3143.99) lat (ms,95%): 4203.93 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 5000 tps: 2124.85 qps: 36289.37 (r/w/o: 24858.20/7181.48/4249.69) lat (ms,95%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 5000 tps: 1444.12 qps: 32683.75 (r/w/o: 23506.98/6289.53/2887.24) lat (ms,95%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 5000 tps: 1941.01 qps: 34125.26 (r/w/o: 23202.18/7041.05/3882.03) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 5000 tps: 1871.04 qps: 35798.72 (r/w/o: 25050.50/7005.14/3743.08) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 5000 tps: 1490.78 qps: 41513.97 (r/w/o: 31148.48/7383.93/2981.57) lat (ms,95%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 5000 tps: 2216.19 qps: 41628.57 (r/w/o: 27761.38/9442.81/4424.38) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 5000 tps: 2045.98 qps: 37306.64 (r/w/o: 25670.75/7535.93/4099.96) lat (ms,95%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 5000 tps: 1671.11 qps: 38214.62 (r/w/o: 27566.89/7305.50/3342.23) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 5000 tps: 1600.99 qps: 28620.87 (r/w/o: 19371.92/6051.97/3196.99) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 5000 tps: 1304.88 qps: 25136.76 (r/w/o: 17470.45/5051.55/2614.77) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 5000 tps: 911.04 qps: 20175.89 (r/w/o: 14865.65/3488.15/1822.08) lat (ms,95%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 5000 tps: 1269.25 qps: 25794.08 (r/w/o: 17736.49/5519.09/2538.50) lat (ms,95%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 5000 tps: 1539.99 qps: 31536.89 (r/w/o: 22309.92/6146.98/3079.99) lat (ms,95%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 5000 tps: 1745.00 qps: 34052.01 (r/w/o: 23797.01/6766.00/3489.00) lat (ms,95%): 2828.87 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 5000 tps: 1195.05 qps: 27344.23 (r/w/o: 19970.90/4984.22/2389.11) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 5000 tps: 2156.88 qps: 43721.47 (r/w/o: 30726.22/8679.50/4315.75) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 5000 tps: 1567.87 qps: 29432.47 (r/w/o: 19899.29/6398.45/3134.73) lat (ms,95%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 5000 tps: 1780.20 qps: 35950.95 (r/w/o: 25385.79/7003.77/3561.39) lat (ms,95%): 9118.47 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 5000 tps: 1774.70 qps: 36724.80 (r/w/o: 25763.65/7411.75/3549.40) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 5000 tps: 1486.07 qps: 32076.61 (r/w/o: 23057.15/6049.30/2970.15) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 5000 tps: 1791.92 qps: 34230.42 (r/w/o: 24388.87/6255.71/3585.83) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 5000 tps: 1209.09 qps: 25117.77 (r/w/o: 17397.22/5302.37/2418.17) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 5000 tps: 1541.93 qps: 30423.70 (r/w/o: 20542.12/6797.71/3083.87) lat (ms,95%): 33340.46 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 5000 tps: 964.97 qps: 20505.44 (r/w/o: 14936.59/3638.90/1929.95) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 5000 tps: 1693.18 qps: 34332.74 (r/w/o: 23921.61/7025.77/3385.37) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 5000 tps: 1911.64 qps: 38826.70 (r/w/o: 27322.86/7679.56/3824.28) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 5000 tps: 1702.34 qps: 35226.08 (r/w/o: 25023.03/6798.37/3404.68) lat (ms,95%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 5000 tps: 1943.74 qps: 38581.88 (r/w/o: 27108.40/7585.99/3887.48) lat (ms,95%): 1149.76 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 5000 tps: 1938.10 qps: 30482.54 (r/w/o: 18139.92/8468.43/3874.20) lat (ms,95%): 49546.69 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 5000 tps: 1220.01 qps: 21336.13 (r/w/o: 14307.09/4588.03/2441.01) lat (ms,95%): 39918.39 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 5000 tps: 1304.80 qps: 33671.77 (r/w/o: 25269.07/5792.10/2610.59) lat (ms,95%): 15371.13 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 5000 tps: 1733.05 qps: 33183.03 (r/w/o: 22504.70/7212.22/3466.11) lat (ms,95%): 2828.87 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 5000 tps: 1856.09 qps: 40269.01 (r/w/o: 28884.44/7672.38/3712.19) lat (ms,95%): 2828.87 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 5000 tps: 1803.10 qps: 35374.01 (r/w/o: 24590.40/7179.41/3604.20) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 5000 tps: 1628.58 qps: 28279.42 (r/w/o: 19227.29/6148.66/2903.48) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 5000 tps: 2934.13 qps: 16731.15 (r/w/o: 5817.23/7965.79/2948.14) lat (ms,95%): 51363.54 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 5000 tps: 37.00 qps: 221.03 (r/w/o: 82.01/102.01/37.00) lat (ms,95%): 52296.79 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 5000 tps: 90.99 qps: 586.95 (r/w/o: 218.98/280.98/86.99) lat (ms,95%): 45280.79 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 5000 tps: 209.01 qps: 1032.06 (r/w/o: 227.01/600.04/205.01) lat (ms,95%): 54214.49 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 5000 tps: 52.00 qps: 221.00 (r/w/o: 37.00/133.00/51.00) lat (ms,95%): 55199.54 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 5000 tps: 237.94 qps: 993.76 (r/w/o: 157.96/596.86/238.94) lat (ms,95%): 57223.68 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 5000 tps: 158.03 qps: 540.11 (r/w/o: 33.01/353.07/154.03) lat (ms,95%): 55199.54 err/s: 0.00 reconn/s: 0.00
[ 128s ] thds: 5000 tps: 132.01 qps: 523.03 (r/w/o: 35.00/358.02/130.01) lat (ms,95%): 56202.50 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 5000 tps: 21.00 qps: 59.99 (r/w/o: 4.00/34.99/21.00) lat (ms,95%): 49546.69 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 5000 tps: 188.03 qps: 1125.16 (r/w/o: 384.06/552.08/189.03) lat (ms,95%): 49546.69 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 5000 tps: 153.91 qps: 756.58 (r/w/o: 165.91/437.75/152.91) lat (ms,95%): 52296.79 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 5000 tps: 79.04 qps: 352.19 (r/w/o: 76.04/196.11/80.04) lat (ms,95%): 43679.10 err/s: 0.00 reconn/s: 0.00
[ 133s ] thds: 5000 tps: 120.97 qps: 561.85 (r/w/o: 105.97/336.91/118.97) lat (ms,95%): 43679.10 err/s: 0.00 reconn/s: 0.00
[ 134s ] thds: 5000 tps: 104.01 qps: 533.05 (r/w/o: 107.01/321.03/105.01) lat (ms,95%): 44472.74 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 4998 tps: 101.00 qps: 491.00 (r/w/o: 84.00/307.00/100.00) lat (ms,95%): 35830.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2731064
        write:                           780304
        other:                           390152
        total:                           3901520
    transactions:                        195076 (1438.29 per sec.)
    queries:                             3901520 (28765.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          135.6284s
    total number of events:              195076

Latency (ms):
         min:                                   11.04
         avg:                                 3154.46
         max:                                72920.11
         95th percentile:                     6835.96
         sum:                            615359935.05

Threads fairness:
    events (avg/stddev):           39.0152/11.29
    execution time (avg/stddev):   123.0720/4.31